index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Involving CPUs into Multi-GPU Deep Learning</title>
<!-- 2017-12-23 Sat 01:04 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Tung Le Duc" />
</head>
<body>
<div id="content">
<h1 class="title">Involving CPUs into Multi-GPU Deep Learning</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Links</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><a href="ICPE_2018_paper_60.pdf">Link to the paper</a></h3>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><a href="https://github.com/tungld/caffe">Public link to the artifact</a></h3>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Getting started</h2>
<div class="outline-text-2" id="text-2">
<p>
We extended Caffe, an open source deep learning framework, to provide features
proposed in the paper.
Features include:
</p>
<ol class="org-ol">
<li>A CPU-based layer-wise reduction method, named CGDP, where gradient
accumulation is done layer by layer using CPUs.
</li>
<li>A method to automatically find a suitable chunk of layers for CGDP so that
the training time is reduced.
</li>
</ol>

<p>
The first feature are mainly implemented in the file <a href="src/caffe/parallel.cpp">src/caffe/parallel.cpp</a>
(L447 to the end of the file). 
The second feature are mainly implemented in the file <a href="src/caffe/solver.cpp">src/caffe/solver.cpp</a>
(L238&#x2013;L308).
</p>

<p>
Because we use CPUs for gradient accumulation via OpenMP, please confirm that there is no
process dominated CPUs on host while running experiments.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Compilation</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Follow <a href="http://caffe.berkeleyvision.org/installation.html">Caffe's installation instructions</a> to compile the source code.
In the paper, we used GPUs for training, thus we need to compile Caffe with CUDA and cuDNN.
We used CUDA v8.0.44 and CuDNN v5.1.5.
</p>

<p>
In general, configure the build by copying and modifying the example <code>Makefile.config.icpe18</code> for your setup.
</p>
<pre class="example">
$ cp Makefile.config.icpe18 Makefile.config
# Adjust Makefile.config (e.g. paths to libraries)
$ make all
</pre>
<p>
After compiling the source code, execution files are generated in the directory <code>build/tools</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Step-by-step instructions</h2>
<div class="outline-text-2" id="text-3">
<p>
Datasets and neural network models for the paper are put in the directory <code>icpe18-artifact</code>
</p>
<pre class="example">
$ ls icpe18-artifact
datasets  models
</pre>
<p>
Datasets are just for measuring performance not accuracy.
</p>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Get results for Figure 6(a)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Figure 6(a) showed a comparison between the original caffe and our CGDP method
for three neural networks: AlexNet, GoogLeNet and VGGNets.  Configuration files
for these networks are in subdirectories named after network names in the
directory <code>icpe18-artifact/models</code>
</p>

<p>
Taking VGGNet as an example, to get the training time for VGGNet with the
original caffe, do as follows:
</p>
<pre class="example">
$ cd icpe18-artifact
$ ../build/tools/caffe.bin train --solver models/vggnet/solver.prototxt --gpu 0,1,2,3 --bvlc
</pre>

<p>
Here, we used 4 GPUs. The screen will print out information like these:
</p>
<pre class="example">
I1221 09:57:55.255875 134492 parallel.cpp:433] Starting Optimization
I1221 09:57:55.256130 134492 solver.cpp:365] Solving VGG_ILSVRC_16_layers
I1221 09:57:55.256141 134492 solver.cpp:366] Learning Rate Policy: step
I1221 09:57:55.716061 134492 solver.cpp:257] Iteration 0, loss = 7.17581
I1221 09:57:55.716094 134492 solver.cpp:273]     Train net output #0: loss/loss = 7.17581 (* 1 = 7.17581 loss)
I1221 09:57:55.816109 134492 sgd_solver.cpp:106] Iteration 0, lr = 0.016968
I1221 09:57:55.832825 134492 solver.cpp:322]     Average time: 0.576444 seconds/iteration
I1221 09:58:00.193527 134492 solver.cpp:257] Iteration 10, loss = 87.3365
I1221 09:58:00.193578 134492 solver.cpp:273]     Train net output #0: loss/loss = 87.3365 (* 1 = 87.3365 loss)
I1221 09:58:00.241466 134492 sgd_solver.cpp:106] Iteration 10, lr = 0.016968
I1221 09:58:00.257027 134492 solver.cpp:322]     Average time: 0.442414 seconds/iteration
I1221 09:58:04.618576 134492 solver.cpp:257] Iteration 20, loss = 87.3365
I1221 09:58:04.618621 134492 solver.cpp:273]     Train net output #0: loss/loss = 87.3365 (* 1 = 87.3365 loss)
I1221 09:58:04.666648 134492 sgd_solver.cpp:106] Iteration 20, lr = 0.016968
I1221 09:58:04.682229 134492 solver.cpp:322]     Average time: 0.442513 seconds/iteration
I1221 09:58:09.043898 134492 solver.cpp:257] Iteration 30, loss = 87.3365
I1221 09:58:09.043943 134492 solver.cpp:273]     Train net output #0: loss/loss = 87.3365 (* 1 = 87.3365 loss)
I1221 09:58:09.092217 134492 sgd_solver.cpp:106] Iteration 30, lr = 0.016968
I1221 09:58:09.107780 134492 solver.cpp:322]     Average time: 0.442547 seconds/iteration
I1221 09:58:13.472877 134492 solver.cpp:257] Iteration 40, loss = 87.3365
I1221 09:58:13.472945 134492 solver.cpp:273]     Train net output #0: loss/loss = 87.3365 (* 1 = 87.3365 loss)
I1221 09:58:13.520750 134492 sgd_solver.cpp:106] Iteration 40, lr = 0.016968
I1221 09:58:13.536312 134492 solver.cpp:322]     Average time: 0.442847 seconds/iteration
</pre>
<p>
where we can see how long does it take for one iteration, i.e. <code>0.442547 seconds/iteration</code>.
</p>

<p>
To get the training time for our CGDP method, just remove the option <code>--bvlc</code> from the command line:
</p>
<pre class="example">
$ cd icpe18-artifact
$ ../build/tools/caffe.bin train --solver models/vggnet/solver.prototxt --gpu 0,1,2,3
</pre>
<p>
The screen will print out information like these:
</p>
<pre class="example">
I1221 10:02:51.489693 134949 parallel.cpp:900] Starting Optimization
I1221 10:02:51.532088 134949 solver.cpp:365] Solving VGG_ILSVRC_16_layers
I1221 10:02:51.532109 134949 solver.cpp:366] Learning Rate Policy: step
I1221 10:02:52.003957 134949 solver.cpp:257] Iteration 0, loss = 7.46468
I1221 10:02:52.004024 134949 solver.cpp:273]     Train net output #0: loss/loss = 7.46468 (* 1 = 7.46468 loss)
I1221 10:02:52.025581 134949 sgd_solver.cpp:106] Iteration 0, lr = 0.016968
I1221 10:02:52.051532 134949 solver.cpp:322]     Average time: 0.519296 seconds/iteration
I1221 10:02:55.631618 134949 solver.cpp:257] Iteration 10, loss = 3.18923
I1221 10:02:55.631703 134949 solver.cpp:273]     Train net output #0: loss/loss = 3.18923 (* 1 = 3.18923 loss)
I1221 10:02:55.633420 134949 sgd_solver.cpp:106] Iteration 10, lr = 0.016968
I1221 10:02:55.645939 134949 solver.cpp:322]     Average time: 0.359434 seconds/iteration
I1221 10:02:59.236099 134949 solver.cpp:257] Iteration 20, loss = 2.48356
I1221 10:02:59.236176 134949 solver.cpp:273]     Train net output #0: loss/loss = 2.48356 (* 1 = 2.48356 loss)
I1221 10:02:59.238724 134949 sgd_solver.cpp:106] Iteration 20, lr = 0.016968
I1221 10:02:59.251245 134949 solver.cpp:322]     Average time: 0.360525 seconds/iteration
I1221 10:03:02.874429 134949 solver.cpp:257] Iteration 30, loss = 2.62243
I1221 10:03:02.874490 134949 solver.cpp:273]     Train net output #0: loss/loss = 2.62243 (* 1 = 2.62243 loss)
I1221 10:03:02.878609 134949 sgd_solver.cpp:106] Iteration 30, lr = 0.016968
I1221 10:03:02.891129 134949 solver.cpp:322]     Average time: 0.363983 seconds/iteration
I1221 10:03:06.519271 134949 solver.cpp:257] Iteration 40, loss = 2.52941
I1221 10:03:06.519323 134949 solver.cpp:273]     Train net output #0: loss/loss = 2.52941 (* 1 = 2.52941 loss)
I1221 10:03:06.524355 134949 sgd_solver.cpp:106] Iteration 40, lr = 0.016968
I1221 10:03:06.536876 134949 solver.cpp:322]     Average time: 0.364569 seconds/iteration
</pre>
<p>
Now the training time is about <code>0.363983 seconds/iteration</code> that is faster than the original Caffe.
</p>

<p>
Do the same comparisons for the other networks, AlexNet and Resnet-152, by replacing the value of <code>--solver</code>.
</p>
<pre class="example">
$ cd icpe18-artifact
# original caffe for AlexNet
$ ../build/tools/caffe.bin train --solver models/bvlc_alexnet/solver.prototxt --gpu 0,1,2,3 --bvlc
# our CGDP method for AlexNet
$ ../build/tools/caffe.bin train --solver models/bvlc_alexnet/solver.prototxt --gpu 0,1,2,3

# original caffe for GoogLeNet
$ ../build/tools/caffe.bin train --solver models/bvlc_googlenet/solver.prototxt --gpu 0,1,2,3 --bvlc
# our CGDP method for GoogLeNet
$ ../build/tools/caffe.bin train --solver models/bvlc_googlenet/solver.prototxt --gpu 0,1,2,3
</pre>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Get results for Figure 8</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Figure 8 showed results for Resnet-152 using our CGDP method together with a
heuristic algorithm to find a good chunk of layers.
</p>

<p>
We will get four following results
</p>
<ol class="org-ol">
<li>Training Resnet-152 with one GPU.
</li>
<li>Training Resnet-152 with 4 GPUs and using original Caffe
</li>
<li>Training Resnet-152 with 4 GPUs and using CGDP
</li>
<li>Training Resnet-152 with 4 GPUs, using CGDP and the heuristic algorithm with different parameters.
</li>
</ol>

<p>
For the first result, invoke the following command:
</p>
<pre class="example">
$ cd icpe18-artifact
$ ../build/tools/caffe.bin train --solver models/resnet-152/solver.prototxt --gpu 0 --bvlc
</pre>

<p>
For the second result, invoke the following command:
</p>
<pre class="example">
$ cd icpe18-artifact
$ ../build/tools/caffe.bin train --solver models/resnet-152/solver.prototxt --gpu 0,1,2,3 --bvlc
</pre>

<p>
For the third result, invoke the following command:
</p>
<pre class="example">
$ cd icpe18-artifact
$ ../build/tools/caffe.bin train --solver models/resnet-152/solver.prototxt --gpu 0,1,2,3
</pre>

<p>
For the fourth result, invoke the following command:
</p>
<pre class="example">
$ cd icpe18-artifact
$ ../build/tools/caffe.bin train --solver models/resnet-152/solver_lwr_opt.prototxt --gpu 0,1,2,3
</pre>

<p>
Parameters for the heuristic algorithm are configured by modifying the file
<code>solver_lwr_opt.prototxt</code>. There are two parameters:
</p>
<ul class="org-ul">
<li><code>lwr_opt_step</code>: the parameter <code>step</code> in the paper
</li>
<li><code>lwr_opt_range</code>: the parameter <code>range</code> in the paper.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class=\"postamble\">Last updated 2017-12-23 Sat 01:04 . Created by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
</div>
</body>
</html>
